Documents/БП_Поручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>БП_Поручение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стартован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесПроцессИсполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийСрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнителиСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПостановки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыМаршрутизацииЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтИмени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротоколаСД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротоколаСД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимостьСозданияРабочейГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервальноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПериодичности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПериодичности2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокИсполнителей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>950</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаВозврата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокВыполненияЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПРосрочки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>950</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВРаботе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПериодичности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/БП_Поручение/Forms/ФормаКонтроля/Ext/Form/Module.bsl
&НаСервере
Функция ВыполненоСервер(ПроверкаУспешно, ПричинаВозврата)
	
	БП = Объект.Заявка.ПолучитьОбъект();
	СтруктураПоиска = Новый Структура("Исполнитель", Объект.Автор);
	НайдденныеСтроки = БП.СписокИсполнителей.НайтиСтроки(СтруктураПоиска);
	Для каждого ТекСтрока Из НайдденныеСтроки Цикл
		ТекСтрока.ПричинаВозврата = ПричинаВозврата;
		ТекСтрока.Исполнено = ПроверкаУспешно;
	КонецЦикла;
	
	СтруктураПоиска = Новый Структура("Исполнено", Ложь);
	Если НЕ БП.СписокИсполнителей.НайтиСтроки(СтруктураПоиска).Количество() Тогда
		БП.Завершен = Истина;
		БП.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		БП.Записать();	
	КонецЕсли;
	
	
	
	
	БПСервер.ВыполнитьЗадачу(Объект.Ссылка,0, ПроверкаУспешно, Комментарии);
	
	Если Не ПроверкаУспешно Тогда
		СоздатьЗадачуИсполнителю(БП.Ссылка);	
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаСервере
Процедура СоздатьЗадачуИсполнителю(БП)
	
		Задача = Задачи.Задача.СоздатьЗадачу();		
		Задача.Заявка = БП;
		Задача.Дата = ТекущаяДата();
		Задача.Наименование = "Доработать по заданию";
		
		//Задача.БизнесПроцесс  = ЭтотОбъект.Ссылка;
		//Задача.ТочкаМаршрута  = ТочкаМаршрутаБизнесПроцесса;
		
		Задача.Автор = ПараметрыСеанса.ТекущийПользователь;
		Задача.Описание = Объект.Описание;
		Задача.Исполнитель = Объект.Автор;
		Задача.Записать();

	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаСогласована(Команда)
	//Если Записать() Тогда
		Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) Тогда
			//Результат = ВыполненоСервер(Истина, "");
			Результат = БПСервер.ВыполнитьКомандуЗадачиБП(Объект.Ссылка, "ЗаявкаСогласована", ПолучитьСтруктуруРеквизитовФормы(), Истина);
			ОповеститьОбИзменении(Объект.Заявка);
			Оповестить("ОбновитьСписокЗадач");
			Если Результат Тогда
				Закрыть();			
			КонецЕсли;
		КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииСервер()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура НаДоработку(Команда)
	
	Если Не ЗначениеЗаполнено(Комментарии) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена причина возврата на доработку", , "Комментарии",, );	
		Возврат;
	КонецЕсли;
	//Если Записать() Тогда
	Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) Тогда
		//Результат = ВыполненоСервер(Ложь, ПричинаВозврата);
		Результат = БПСервер.ВыполнитьКомандуЗадачиБП(Объект.Ссылка, "НаДоработку", ПолучитьСтруктуруРеквизитовФормы(Истина), Истина);
		ОповеститьОбИзменении(Объект.Ссылка);
		Оповестить("ОбновитьСписокЗадач");
		Если Результат Тогда
			Закрыть();			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Если ИмяСобытия = "ПрикрепленныеФайлы" Тогда	
	//	ОбщегоНазначенияКлиентСервер.ОбновитьКоличествоПрикрепленныхФайлов(ЭтаФорма);
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БП = Объект.Заявка.ПолучитьОбъект();
	
	Документ = БП.Документ;
	Если Объект.Автор = БП.Автор Тогда
		ТекИсполнитель = Объект.Исполнитель;
	Иначе
		ТекИсполнитель = Объект.Автор;
	КонецЕсли;
	
	Тема = БП.Тема;
	
	СтруктураПоиска = Новый Структура("Исполнитель", ТекИсполнитель);
	НайдденныеСтроки = БП.СписокИсполнителей.НайтиСтроки(СтруктураПоиска);
	Для каждого ТекСтрока Из НайдденныеСтроки Цикл
		КомментарииИсполнителя = ТекСтрока.Комментарии;
		Приложение = ТекСтрока.Приложение;	
		Пользователь = ТекСтрока.Пользователь;	
		ПричинаВозврата = ТекСтрока.ПричинаВозврата;	
		СрокИсполнения = ТекСтрока.СрокИсполнения;	
		ДатаВыполнения = ТекСтрока.ДатаВыполнения;	
	КонецЦикла;
	
	Если БюджетныйНаСервере.ПолучитьПользователя() = Объект.Автор И НЕ Объект.Исполнитель = БюджетныйНаСервере.ПолучитьПользователя() Тогда //если исполнитель = текущему пользователю, то не показывать кнопку ОК
		Элементы.ЗаявкаСогласована.Видимость = Ложь;	
		Элементы.НаДоработку.Видимость = Ложь;	
	КонецЕсли;
	Если ПричинаВозврата = "" Тогда
		Элементы.ПричинаВозврата.Видимость = Ложь;	
	КонецЕсли;
	Если ДатаВыполнения > СрокИсполнения Тогда
		//Элементы.ДатаВыполнения.Нач;
		Элементы.ДатаВыполнения.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруРеквизитовФормы(КомментарийРавноПричинеВозврата = Ложь)
	
	Результат = новый Структура();
	
	Результат.Вставить("Комментарий", Комментарии);
	Если КомментарийРавноПричинеВозврата Тогда
		Результат.Вставить("ПричинаВозврата", Комментарии);
	Иначе
		Результат.Вставить("ПричинаВозврата", ПричинаВозврата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
